// Transcript: Report of testing

?- consult('family_facts.pl').
true.

?- consult('family_rules.pl').
true.

?- consult('questions.pl').
true.

?- is_brother(john, bob).
false.

?- is_cousin(john, julia).
false.

?- consult('questions.pl').
true.

?- is_cousin(john, julia).
false.

?- is_brother(john, bob).
false.

?- who_children('Peter', X).
false.

?- who_nieces_nephews('Robert', X).
false.

?- who_siblings('John', X).
false.

?- who_children('linda', 'ben').
ben is a child of linda
true.

?- who_female_children('susan','julia').
julia is a female child of susan
true.

?- is_ancestor('jane', 'emma').
jane is an ancestor of emma
true .

?- who_nieces_nephews('John','jim').
false.
